{
  "0.2.7.6": [
    "**Minimap Overhaul & Enhancements:**",
    "- *Size Increase:* The minimap has been significantly enlarged (approximately doubled in size) for better visibility and detail.",
    "- *Toggle Functionality:* The minimap can now be shown or hidden using a new integrated toggle button.",
    "- *UI Integration:* The toggle button is styled as a sleek bar at the top of the minimap, effectively replacing the previous thick padding border for a cleaner look.",
    "- *Cleaner Look:* Internal padding within the minimap canvas has been reduced, allowing drawn content to extend closer to its edges and the new toggle button."
  ],
  "0.2.7.5": [
    "**Optimization:**",
    "- Made some improvements to the minimap."
  ],
  "0.2.7.4": [
    "**Patch Notes Enhanced!**",
    "- Implemented **Markdown** support for displaying patch notes using the `marked.js` library.",
    "- Notes can now include *italics*, **bold text**, lists, and other Markdown features for improved readability."
  ],
  "0.2.7.3": [
    "**Minimap Enhancements:**",
    "- Dynamic Minimap Zoom: The minimap now dynamically zooms relative to the main map's zoom level, offering a more detailed local overview when zoomed in.",
    "- Minimap Centering: The minimap's view now centers on the main map's current viewport.",
    "**UI Fixes & Improvements:**",
    "- Resolved UI Overlap: Fixed an issue where the Settings panel would overlap the minimap when opened.",
    "- Restored Drawing Functions: Corrected main map drawing functions to resolve a black screen issue from a previous development error.",
    "- Improved Initial Zoom: Adjusted the 'Fit' zoom level to ensure better map visibility on load.",
    "**Internal & Robustness:**",
    "- Improved minimap scale calculation and added further guards against invalid numeric states."
  ],
  "0.2.7.0": [
    "**New Feature: Minimap Implemented!**",
    "- A new minimap is now available in the top-right corner, providing an overview of the entire game world.",
    "- Key structures (King's Castle, Fortresses) and Biome regions are displayed on the minimap.",
    "- A white rectangle on the minimap indicates your current viewport on the main map.",
    "- *Click to Pan:* Clicking on the minimap will instantly pan the main map to that location.",
    "**UI Enhancements & Reorganization:**",
    "- The 'Go To' coordinate search has been moved to the top of the left-side panel.",
    "- Display toggles, Performance settings, and Info/Stats are now consolidated into a new collapsible '⚙️ Settings' panel in the top-right.",
    "- Updated the Stats button icon to 📊.",
    "**Internal & Performance:**",
    "- Minor performance improvement by caching the 'Tile Detail' threshold.",
    "- Consolidated some internal filtering logic for building visibility.",
    "**Bug Fixes:**",
    "- Corrected a minor HTML class name typo in the patch notes modal footer."
  ],
  "0.2.6.3": [
    "**Performance:**",
    "- Made some minor performance improvements."
  ],
  "0.2.6.2": [
    "**Zooming:**",
    "- Made a few tweaks to adjust zooming feel and responsiveness."
  ],
  "0.2.6.1": [
    "**Bug Fix Attempt:**",
    "- Attempted to fix an issue with the statistics panel not updating correctly."
  ],
  "0.2.6.0": [
    "**Major Refactor & Features:**",
    "- Completed a major internal code refactor for improved long-term stability and easier future updates.",
    "- Added a 'ping' effect: selections now flash briefly to make them easier to locate on the map.",
    "- The settings panel in the top-right has been reorganized with headers for better clarity.",
    "**Bug Fixes:**",
    "- Fixed a minor performance issue where buildings were being drawn twice."
  ],
  "0.2.5.12": [
    "**Alliance RSS Enhancements:**",
    "- Added a new 'Always Show RSS' toggle for Alliance RSS buildings.",
    "- When enabled, this new option will keep Alliance RSS buildings visible on the map at all zoom levels.",
    "**Bug Fixes:**",
    "- Fixed a rendering bug that was causing buildings to be drawn twice in high-detail view."
  ],
  "0.2.5.11": [
    "**Critical Bug Fix:**",
    "- Fixed a critical bug where Alliance RSS buildings were not filling their entire 2x2 area, leaving parts of the tile uncolored.",
    "- Refactored the building rendering logic to be more efficient and prevent similar bugs in the future."
  ],
  "0.2.5.10": [
    "**Alliance RSS Fixes:**",
    "- Fixed a bug where Alliance RSS buildings were rendered as 1x1 tiles instead of the correct 2x2 size.",
    "- Fixed an issue where the names of Alliance RSS buildings (e.g., 'Wood', 'Food') were not being displayed on the map."
  ],
  "0.2.5.9": [
    "**New Feature: Alliance RSS Layer**",
    "- Added a new toggleable layer for 'Alliance RSS' buildings.",
    "- Alliance resource nodes (Wood, Food, Stone, Iron) will now render on the map with unique colors.",
    "- A new 'Show Alliance RSS' checkbox has been added to the top-right panel to control their visibility."
  ],
  "0.2.5.8": [
    "**Settings UI Overhaul:**",
    "- Replaced the confusing 'Quality' dropdown with two separate, clearer settings:",
    "  - New *'Tile Detail'* setting now controls only when tiles merge together at low zoom levels.",
    "  - New *'Show Gridlines'* checkbox gives users direct control over gridline visibility for a major performance boost."
  ],
  "0.2.5.7": [
    "**Performance/Quality Control:**",
    "- Added a 'Quality' dropdown menu in the top-right panel.",
    "- Users can now choose their preferred performance vs. visual quality setting.",
    "- Settings include: _Low_, _Normal_, _High_, and _Ultra (No Merging)_ to accommodate a wide range of devices.",
    "- The selected quality setting is saved and remembered for your next visit."
  ],
  "0.2.5.5": [
    "**Camera Improvements:**",
    "- Made improvements to the zoom camera behavior."
  ],
  "0.2.5.4": [
    "**Visual Updates:**",
    "- Changed the color palette of existing buildings.",
    "- Implemented Sanctuaries on the map."
  ],
  "0.2.5.3": [
    "**Bug Fix:**",
    "- Fixed the patch notes not showing and updating correctly."
  ],
  "0.2.5.2": [
    "**UI & Performance:**",
    "- Improved the vertical zoom slider for better precision and a more consistent layout on different screen sizes.",
    "- Optimized application startup by moving patch notes to an external file."
  ],
  "0.2.5.1": [
    "**Initial UI Overhaul & Features:**",
    "- Redesigned UI layout for improved usability.",
    "- Added a vertical zoom slider on the left.",
    "- Implemented a configurable display for tile coordinates.",
    "- Fixed building name text overflowing its container.",
    "- Added this patch notes window and versioning system."
  ],
  "0.2.5.0": [
    "**Initial Release:**",
    "- Initial public release version with core features."
  ]
}