{
  "0.2.5.10": [
    "Fixed a bug where Alliance RSS buildings were rendered as 1x1 tiles instead of the correct 2x2 size.",
    "Fixed an issue where the names of Alliance RSS buildings (e.g., 'Wood', 'Food') were not being displayed on the map."
  ],
  "0.2.5.9": [
    "Added a new toggleable layer for 'Alliance RSS' buildings.",
    "Alliance resource nodes (Wood, Food, Stone, Iron) will now render on the map with unique colors.",
    "A new 'Show Alliance RSS' checkbox has been added to the top-right panel to control their visibility."
  ],
  "0.2.5.8": [
    "Replaced the confusing 'Quality' dropdown with two separate, clearer settings.",
    "New 'Tile Detail' setting now controls only when tiles merge together at low zoom levels.",
    "New 'Show Gridlines' checkbox gives users direct control over gridline visibility for a major performance boost."
  ],
  "0.2.5.7": [
    "Added a 'Quality' dropdown menu in the top-right panel.",
    "Users can now choose their preferred performance vs. visual quality setting.",
    "Settings include 'Low', 'Normal', 'High', and 'Ultra (No Merging)' to accommodate a wide range of devices.",
    "The selected quality setting is saved and remembered for your next visit."
  ],
  "0.2.5.5": [
    "Made improvements to the zoom camera"
  ],
  "0.2.5.4": [
    "Changed the color pallete of existing buildings.",
    "Implemented Sanctuaries"
  ],
  "0.2.5.3": [
    "Fixed the patch notes not showing and updating correctly"
  ],
  "0.2.5.2": [
    "Improved the vertical zoom slider for better precision and a more consistent layout on different screen sizes.",
    "Optimized application startup by moving patch notes to an external file."
  ],
  "0.2.5.1": [
    "Redesigned UI layout for improved usability.",
    "Added a vertical zoom slider on the left.",
    "Implemented a configurable display for tile coordinates.",
    "Fixed building name text overflowing its container.",
    "Added this patch notes window and versioning system."
  ],
  "0.2.5.0": [
    "Initial public release version with core features."
  ]
}